src/main/resources/reports/stage2/get_results/wrk_get_poll.txt
Running 10s test @ http://localhost:8080
  1 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.59ms    1.27ms  37.73ms   93.70%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.40ms
 75.000%    1.89ms
 90.000%    2.53ms
 99.000%    5.66ms
 99.900%   17.12ms
 99.990%   34.85ms
 99.999%   36.83ms
100.000%   37.76ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.130     0.000000            1         1.00
       0.687     0.100000        10014         1.11
       0.882     0.200000        19976         1.25
       1.059     0.300000        29915         1.43
       1.233     0.400000        39892         1.67
       1.405     0.500000        49845         2.00
       1.489     0.550000        54823         2.22
       1.575     0.600000        59785         2.50
       1.670     0.650000        64802         2.86
       1.773     0.700000        69774         3.33
       1.891     0.750000        74722         4.00
       1.966     0.775000        77248         4.44
       2.049     0.800000        79757         5.00
       2.143     0.825000        82198         5.71
       2.253     0.850000        84683         6.67
       2.383     0.875000        87190         8.00
       2.453     0.887500        88441         8.89
       2.529     0.900000        89673        10.00
       2.613     0.912500        90912        11.43
       2.711     0.925000        92183        13.33
       2.821     0.937500        93402        16.00
       2.887     0.943750        94035        17.78
       2.973     0.950000        94654        20.00
       3.069     0.956250        95280        22.86
       3.189     0.962500        95892        26.67
       3.357     0.968750        96512        32.00
       3.475     0.971875        96824        35.56
       3.627     0.975000        97138        40.00
       3.859     0.978125        97449        45.71
       4.187     0.981250        97759        53.33
       4.615     0.984375        98069        64.00
       4.843     0.985938        98226        71.11
       5.095     0.987500        98380        80.00
       5.411     0.989062        98537        91.43
       5.815     0.990625        98692       106.67
       6.191     0.992188        98847       128.00
       6.435     0.992969        98926       142.22
       6.759     0.993750        99003       160.00
       7.119     0.994531        99084       182.86
       7.679     0.995313        99159       213.33
       8.351     0.996094        99236       256.00
       8.719     0.996484        99276       284.44
       9.055     0.996875        99314       320.00
       9.599     0.997266        99353       365.71
      10.383     0.997656        99393       426.67
      11.719     0.998047        99431       512.00
      12.767     0.998242        99450       568.89
      14.007     0.998437        99470       640.00
      14.799     0.998633        99489       731.43
      15.599     0.998828        99509       853.33
      17.759     0.999023        99528      1024.00
      18.751     0.999121        99538      1137.78
      20.239     0.999219        99548      1280.00
      21.343     0.999316        99557      1462.86
      23.039     0.999414        99567      1706.67
      24.959     0.999512        99577      2048.00
      25.423     0.999561        99582      2275.56
      26.335     0.999609        99587      2560.00
      27.247     0.999658        99591      2925.71
      28.959     0.999707        99596      3413.33
      29.887     0.999756        99601      4096.00
      30.975     0.999780        99604      4551.11
      31.119     0.999805        99606      5120.00
      32.207     0.999829        99608      5851.43
      33.151     0.999854        99611      6826.67
      34.047     0.999878        99613      8192.00
      34.847     0.999890        99615      9102.22
      35.007     0.999902        99616     10240.00
      35.231     0.999915        99617     11702.86
      35.295     0.999927        99618     13653.33
      35.359     0.999939        99619     16384.00
      35.391     0.999945        99620     18204.44
      35.839     0.999951        99621     20480.00
      35.839     0.999957        99621     23405.71
      36.575     0.999963        99623     27306.67
      36.575     0.999969        99623     32768.00
      36.575     0.999973        99623     36408.89
      36.575     0.999976        99623     40960.00
      36.575     0.999979        99623     46811.43
      36.831     0.999982        99624     54613.33
      36.831     0.999985        99624     65536.00
      36.831     0.999986        99624     72817.78
      36.831     0.999988        99624     81920.00
      36.831     0.999989        99624     93622.86
      37.759     0.999991        99625    109226.67
      37.759     1.000000        99625          inf
#[Mean    =        1.590, StdDeviation   =        1.266]
#[Max     =       37.728, Total count    =        99625]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  99626 requests in 10.00s, 381.07MB read
  Non-2xx or 3xx responses: 3665
Requests/sec:   9962.65
Transfer/sec:     38.11MB